english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* bring
:PROPERTIES:
:EXPORT_FILE_NAME: bring.md
:END:
带来up, down, in, on, to
** 语义
*** 带来
Did you bring an umbrella?
*** 引起
The strikes are expected to bring chaos.
*** 处于某种状况
It was the war that first brought him to power.
*** 使发生
The 1930s brought unemployment and economic recession.
*** 向...播出
This programme is brought to you by the BBC.
** 短语
*** [#C] bring a lawsuit
Survivors of the fire later brought a billion-dollar lawsuit against the company.

https://youglish.com/getbyid/35543606/bring%20a%20lawsuit/english
*** [#C] bring a smile to somebody's lips
Her words brought a sudden smile to his lips.

https://youglish.com/getbyid/1583204/bring%20a%20smile/english
*** [#C] bring the total to something
This brings the total to 46.

https://youglish.com/getbyid/11484428/bring%20the%20total%20to/english
*** bring something to bear
The full force of the law was brought to bear on anyone who criticized the government.

https://youglish.com/getbyid/77972918/bring%20to%20bear/english
*** bring around/round
**** 把话题转移到某件事上
I'll try to bring the conversation around to the subject of money.

https://youglish.com/getbyid/9138794/bring%20around/english
**** 使恢复知觉
I slapped his face a couple of times to try to bring him round.
**** 说服
She won't listen to me. Let's see if Sue can bring her round.
**** 把...带过来
I'll bring the books around tommorrow.

https://youglish.com/getbyid/87264943/bring%20around/english
*** [#A] bring back
**** 恢复
The city council has decided to bring back the old electric *trams*.

https://youglish.com/getbyid/77892814/bring%20back/english
**** 使想起某事
The trip brought back a lot of happy memories.
**** 使重返岗位
Following their latest defeat, soccer fans are urging the club to bring back the former manager.
*** [#A] bring down
**** 减少
The government hopes these measures will help to bring down inflation.

https://youglish.com/getbyid/77876560/bring%20down/english
**** 使飞机降落
The pilot managed to bring the plane down safely.
**** 击落
A bomber had been brought down by anti-aircraft fire.

https://youglish.com/getbyid/5031973/bring%20down/english
**** 使下台
A crisis could bring down the government.
**** 使跌倒
He was brought down by the goalkeeper and awarded a penalty.
*** bring something down on somebody
His recklessness brought down disaster on the whole family.
*** bring forward
**** 将...提前
The meeting's been brought forward to Thursday.
**** 提出法规
The government has brought forward new proposals to tackle the problem of increasing crime.

https://youglish.com/getbyid/56250521/bring%20forward/english
**** 结转
The balance brought forward is $21765.
*** bring in
**** 推行
Harsh anti-trade union laws were brought in in the early 1980s.
**** 请...参与
I'd like to bring in Doctor Hall here and ask him his views.

https://youglish.com/getbyid/148388687/bring%20in/english
**** 使挣到
The sale of the house only brought in about $45000.
**** 吸引
We've got to bring in more business if we want the restaurant to survive.

https://youglish.com/getbyid/139053925/bring%20in/english
**** 作出判决
The jury brought in a verdict of not guilty.
*** bring into
**** 使处于
Most of the land has now been brought into cultivation.
**** 使参与
The government is trying to bring teachers into the debate on education.

https://youglish.com/getbyid/77871204/bring%20into/english
*** bring off
They managed to bring off the most daring jewellery robbery in history.

https://youglish.com/getbyid/1171094/bring%20off/english
*** bring on
**** 导致
Stress can bring on an *asthma* attack.
**** 使进步
Teachers have to bring on the bright children and at the same time give extra help to those who need it.
**** 促进生长
Keeping the young plants in a greenhouse will help bring them on.
*** bring onto
This brings me onto the question of pay rises.
*** bring out
**** 使显现
The spices really bring out the flavour of the meat.
**** 推出
He's bringing out a new *album* next month.
**** 把...拿出来
Jenny opened the cupboard and brought out a couple of bottles.
*** bring out the best in somebody
Alcohol just brings out the worst in her.
*** bring somebody out of himself
Changing schools has really brought her out of herself.
*** bring somebody out in something
Any foods containing *wheat* bring him out in a *rash*.
*** bring somebody through
Both my children have brought me through extremely difficult times since my husband died.
*** bring together
**** 把...召集起来
We brought together researchers from three different universities to work on the project.
**** 使联合起来
Any attack by a foreign power will *inevitably* bring the people of a country together.
*** bring up
**** 提起
Why dis you have to bring up the subject of money?
**** 养育
He was brought up by his grandparents.
**** 把...调出来
Can you bring up the list of candidates again?
**** 吐出
I had a sandwich for lunch and promptly brought it up again.
**** 提审
He was brought up before a *magistrate*, charged with dangerous driving.
**** bring somebody up with a short
Her question brought me up short.